[{"authors":["admin"],"categories":null,"content":"Chiu Yu Ko obtained his M.Phil.(Economics) and B.B.A.(Insurance, Financial and Actuarial Analysis) degrees from the Chinese University of Hong Kong in 2005 and 2007. He received his Ph.D.(Economics) from Boston College in 2012. Upon graduation, he has joined the Department of Economics in the National University of Singapore as an assistant professor.\nHis research focuses on game theory with application in resource allocation, industrial organization, and political economy. For resource allocation, he works on the problem of fair sharing. For industrial organization, he specializes in innovation and platform competition. For political economy, he is interested in the design of a political system. His research has been published/accepted in peer-reviewed journals including Canadian Journal of Economics, International Economic Review, Games and Economic Behavior, Journal of Economic Theory, Journal of Economic and Management Strategy, Journal of Environmental Economics and Management, and Theory and Decision.\nHe teaches Microeconomic Analysis III (undergraduate), Financial Market Microstructure (undergraduate), Applied Financial Economics (Master) and Industrial Organization (Ph. D). He has been the main advisor for two Ph.D. students and honor thesis for more than a dozen undergraduate students. He subscribes to the philosophy that effective learning requires an understanding of multiple facets in both depth and breadth. He also believes that giving students continuous feedback during the course is crucial as it means they learn from their mistakes, consolidate the knowledge they have acquired and gives them the motivation to explore further and deeper.\n","date":-62135596800,"expirydate":-62135596800,"kind":"section","lang":"en","lastmod":-62135596800,"objectID":"598b63dd58b43bce02403646f240cd3c","permalink":"/authors/admin/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/authors/admin/","section":"author","summary":"Chiu Yu Ko obtained his M.Phil.(Economics) and B.B.A.(Insurance, Financial and Actuarial Analysis) degrees from the Chinese University of Hong Kong in 2005 and 2007. He received his Ph.D.(Economics) from Boston College in 2012. Upon graduation, he has joined the Department of Economics in the National University of Singapore as an assistant professor.\nHis research focuses on game theory with application in resource allocation, industrial organization, and political economy. For resource allocation, he works on the problem of fair sharing.","tags":null,"title":"Chiu Yu Ko","type":"author"},{"authors":null,"categories":null,"content":"This contains\u0026hellip;ddd\n Project or software documentation Online courses Tutorials  The parent folder may be renamed, for example, to docs for project documentation or course for creating an online course.\nTo disable this feature, either delete the parent folder, or set draft = true in the front matter of all its pages.\nAfter renaming or deleting the parent folder, you may wish to update any [[menu.main]] menu links to it in the config.toml.\n","date":1536422400,"expirydate":-62135596800,"kind":"section","lang":"en","lastmod":1536422400,"objectID":"e407031453d380e2188ac56763501c52","permalink":"/others/","publishdate":"2018-09-09T00:00:00+08:00","relpermalink":"/others/","section":"others","summary":"This contains\u0026hellip;ddd\n Project or software documentation Online courses Tutorials  The parent folder may be renamed, for example, to docs for project documentation or course for creating an online course.\nTo disable this feature, either delete the parent folder, or set draft = true in the front matter of all its pages.\nAfter renaming or deleting the parent folder, you may wish to update any [[menu.main]] menu links to it in the config.","tags":null,"title":"Overview","type":"docs"},{"authors":null,"categories":null,"content":"This contains\n Book: Technical Analysis with R Package: CandleStickPattern  Slides\n","date":1536422400,"expirydate":-62135596800,"kind":"section","lang":"en","lastmod":1536422400,"objectID":"f2fbe31bf91947f86781e8f880800fb7","permalink":"/r/","publishdate":"2018-09-09T00:00:00+08:00","relpermalink":"/r/","section":"r","summary":"This contains\n Book: Technical Analysis with R Package: CandleStickPattern  Slides","tags":null,"title":"R Overview","type":"docs"},{"authors":[],"categories":null,"content":" Click on the Slides button above to view the built-in slides feature.   Slides can be added in a few ways:\n Create slides using Academic\u0026rsquo;s Slides feature and link using slides parameter in the front matter of the talk file Upload an existing slide deck to static/ and link using url_slides parameter in the front matter of the talk file Embed your slides (e.g. Google Slides) or presentation video on this page using shortcodes.  Further talk details can easily be added to this page using Markdown and $\\rm \\LaTeX$ math code.\n","date":1906520400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1906520400,"objectID":"96344c08df50a1b693cc40432115cbe3","permalink":"/talk/example/","publishdate":"2017-01-01T00:00:00+08:00","relpermalink":"/talk/example/","section":"talk","summary":"An example talk using Academic's Markdown slides feature.","tags":[],"title":"Example Talk","type":"talk"},{"authors":["Chiu Yu Ko","Duozhe Li"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1565971200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1565971200,"objectID":"d21df23ab0e34c6620e9660f9af4e66a","permalink":"/workingpaper/many-to-one-bargaining/","publishdate":"2019-08-17T00:00:00+08:00","relpermalink":"/workingpaper/many-to-one-bargaining/","section":"workingpaper","summary":"An industry-wide research joint venture (RJV) does not lead to better technological development or a higher consumer surplus. In contrast, every non-industry-wide RJV leads to strict improvements in both measures. Our results continue to hold when technology transfer is possible. Independent collaboration with technology transfer is an alternative to establishing industry-wide research consortiums.","tags":["Game Theory","Industrial Organization","Innovation"],"title":"Decentralized one-to-many Bargaining (with Duozhe Li), R\u0026R at International Economic Review","type":"workingpaper"},{"authors":["Chiu Yu Ko","Bo Shen"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1565971200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1565971200,"objectID":"2ef2662ad211f1c2d770d287dd1a5ad9","permalink":"/workingpaper/win-win/","publishdate":"2019-08-17T00:00:00+08:00","relpermalink":"/workingpaper/win-win/","section":"workingpaper","summary":"An industry-wide research joint venture (RJV) does not lead to better technological development or a higher consumer surplus. In contrast, every non-industry-wide RJV leads to strict improvements in both measures. Our results continue to hold when technology transfer is possible. Independent collaboration with technology transfer is an alternative to establishing industry-wide research consortiums.","tags":["Game Theory","Industrial Organization","Innovation"],"title":"From win-win to winner-take-all (with Bo Shen), R\u0026R at Economic Inquiry","type":"workingpaper"},{"authors":["Chiu Yu Ko","Xuyao Zhang"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1565971200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1565971200,"objectID":"e4b8471214d72c28c60f8aaff4d76067","permalink":"/publication/rjv-transfer/","publishdate":"2019-08-17T00:00:00+08:00","relpermalink":"/publication/rjv-transfer/","section":"publication","summary":"An industry-wide research joint venture (RJV) does not lead to better technological development or a higher consumer surplus. In contrast, every non-industry-wide RJV leads to strict improvements in both measures. Our results continue to hold when technology transfer is possible. Independent collaboration with technology transfer is an alternative to establishing industry-wide research consortiums.","tags":["Game Theory","Industrial Organization","Innovation"],"title":"Research Joint Venture with Technology Transfer","type":"publication"},{"authors":["Chiu Yu Ko"],"categories":null,"content":"I have written an introductory book with R, titled Technical Analysis with R*\u0026rdquo;. Readers are prepared how to do\n data manipulation (dyplr package), conduct econometric analysis (regression, time series), plotting (ggplot2 package, dygraphs package), webscrapping (rvest package, wbstat package, quantmod package), and financial analysis (quantmod package, quantstrat package). backtest a complex trading strategy and evaluate the performance.    The book is available through bookdown (free online gitbook) or Gumroad (name-your-own-price offline pdf and epub). You can read the whole book through bookdown. Of course, you are very welcome to consider buying me a cup of coffee by purchasing the ebook.\n(Note: After purchasing through Gumroad, you can download pdf and epub.)\n Supplementary notes can be added here, including code and math.   ","date":1565971200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1565971200,"objectID":"ea83a2177a8c2e81f1c1dfba086a01fc","permalink":"/book/technical-trading-r/","publishdate":"2019-08-17T00:00:00+08:00","relpermalink":"/book/technical-trading-r/","section":"book","summary":"This is an introductory textbook that focuses on how to use R to test a technical trading strategy. No prior programming knowledge is needed..","tags":["Game Theory","Industrial Organization","Innovation"],"title":"Technical Analysis with R","type":"book"},{"authors":["Chiu Yu Ko"],"categories":null,"content":"TikZ is a drawing package in LaTeX. It is very useful to draw a professional-looking diagram. However, the learning curve is a little bit steep for a beginner. I have recently compiled a 629-page cookbook that provides step-by-step illustrations on how to use TikZ to draw various diagrams in economics:\n  The book is available through Google Play or Google book. You can read the whole book through free sampling and preview. If you think that I have done a good or bad job, please feel free to drop me an email with comments/suggestions or write a short review here. Of course, you are very welcome to consider buying me a cup of coffee through purchasing the ebook.\nNote: After purchasing, you may copy code directly through Google Play (only benefit of spending your money) and you can download a pdf file of the book but the pdf file does not allow search nor copy.\n(Note: After purchasing through Gumroad, you can download pdf and epub.)\n Supplementary notes can be added here, including code and math.   ","date":1565971200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1565971200,"objectID":"68111ea64683fad8bab346e231d4c15b","permalink":"/book/tikz-cookbook/","publishdate":"2019-08-17T00:00:00+08:00","relpermalink":"/book/tikz-cookbook/","section":"book","summary":"TikZ is a drawing package in LaTeX. It is very useful to draw a professional-looking diagram. However, the learning curve is a little bit steep for a beginner. This is a cookbook that provides step-by-step illustrations on how to use TikZ to draw various diagrams in economics.","tags":["Game Theory","Industrial Organization","Innovation"],"title":"TikZ Cookbook","type":"book"},{"authors":null,"categories":null,"content":" This tips is for economic academic job market. This note was prepared based on information adapted from many different sources and experiences of me and others. Now I can no longer tell which part is mine and which part is other. Good luck!\nTimeline Job Market Process usually starts from summer until the April the year after.\n Summer: Get approval from advisor September: Final version of paper October: Register for AEA conference and get ready for application November: Send applications December: Schedule and prepare for interviews January: AEA meeting and flyout February-April: Flyout and offers  Summer: Get approval from advisor  Get one main paper ready (Job market paper; JMP) Polish the paper and send it to your committee. Only plan to go to the market if your advisor says yes. Start preparation of application materials:  Personal website Professional picture (U-Town has photo taking service) CV (1-page) Research statement Teaching statement (with teaching evaluation)   September: Final Polishing of Paper  Job Openings for Economists (JOE): http://www.aeaweb.org/joe/ contains almost all job information for Ph.D. economists EconJobMarket (EJM): https://econjobmarket.org/ Final polishing of the JMP, especially your abstract and introduction  October: Register for AEA and get ready for application  Register for the AEA conference  Make flight and hotel reservations. Choose a hotel closet to the Head-Quarters (HQ) hotel but NOT in the HQ hotel. (because HQ hotel has too many people!) Aim to arrive at AEAs for Wednesday night or Thursday morning. Make hotel arrangements immediately as rooms get booked really quick  JOE: LOTS of openings  Look specifically at openings in  Within your field Any Fields: check with your network to see any insider information General Economics/Teaching  Check for late October/early November deadlines. Most are mid or late November or December.  Create an spread document to organize openings and their dead- lines. (share with your classmates!) Compile a list of schools you plan to apply Do NOT apply jobs not in your field or to places you would never go. This wastes your and others time and bad for your fellow class- mates. To aim too high or too low as other schools may know you are not making serious applications – Run the list with your advisors.   Get ready for your application material:  Check information of the schools you want to apply (You will need need it to mention it in your cover letter.) Upload your website (with JMP, photo, CV, research/teaching state- ments) Complete your CV Polish your research and teaching statements.   November: Send Application Packages  JOE: LOTS of openings here. Some will repeat from October JOE.  Many will have deadlines of November 15th, 30th, December 1st or 15th  During this month, only do applications Do all or almost all applications before the end of third week (Thanksgiving in US)\n Pay attention to the deadline for the AEA 2 job signals you get to send. Details on AEA signaling\n Most applications are done online at econjobmarket.org or via the institu- tions website.\n A typical application packet for mailing includes:\n Cover letter. Different letters for research, teaching and non-academic jobs. Customize for a few places you are most interested in. JMP. Other research papers only if well-polished and approved by your advi- sor 3–4 letters of recommendation. Perhaps a teaching letter as well. Your CV (modify the ordering of your research fields depending on the listed opening). Teaching evaluations (if academic). Teaching statement (if academic, particularly liberal arts schools). Research statement (summary of your papers, and your ongoing re- search) An unofficial or official graduate transcript (sometimes). Chinese CV (for chinese schools)  Keep your advisors/secretary posted on where to send e-mail, upload or mail reference letters. Let them know your deadlines.\n  December: Schedule and Prepare Interviews  December JOE: some relevant openings here but not as many as in the prior 2 months. Places start calling or e-mailing to set up interviews at the AEAs (before Christmas). Be polite (and sound happy they called!) and ask for the following informa- tion:  Institution 2. Person who called/e-mailed and their contact information. The name and contact information for the contact person at the AEA meetings. Day and time of the interview and hotel it will take place in. Disclosure code (this is the code you will get and look up online during the meetings to find out the exact room the interview takes place in). Other people who will be at the interview  Scheduling of interviews:  Act quickly! Good spots fill up quickly. o Put less important interviews on Thursday night or early Friday morn- ing as warm up. Put the most important ones at the times you are in the best shape! AT LEAST 15 minutes between interviews, especially for switching ho- tels. Look at a map when you are scheduling (Game is over if you are late for interview) Try to have a string of interviews in the same hotel. Try to leave a little bit of room for lunch if you can. If you do not have enough (less than 10) interviews, talk to your advi- sors.  Interview Preparation:  In late December, set up mock interviews with faculty members. Do 6-8 and mix and match faculty so that you have 2 faculty members in different fields. Prepare 2-, 5-, and 15-minute versions about your JMP!  Embed them into each other. Be flexible and be prepared to be derailed. Dont sounding like you are memorizing! No one like to talk to machine. 2-minute version: simple enough for people outside your field to understanding; give people a big picture; make your idea interesting to people outside your field 5-minute version: Go into greater details of what you are doing; you should tell how your work different from existing literature 15-minute version: Let the expert in your field to know what you are doing and let people outside you field to also feel that they know you are doing something seems interesting and useful Questions:  Have you submitted the paper? Where you are going to submit it? How you come up with this idea? Prepare to talk to other papers  What’s next in terms of research?  Teaching questions:  What classes can you teach? Which textbook you are going to use? What topics you are going to cover?  Do research on the school you are going to interview.  Why you would like to come to our place? Try to understand the research of the people who are in the inter- view  Get your suits ready:  2 suits, 4 shirts, 1 handbag and 2 good shoes.  Have a good hair cut     Early January: AEA Meetings!  If you followed the advice, you should have:  Booked a hotel that is very close to but not in the headquarters Arrive Wednesday night. (or before) Have 1-2 suits and comfortable shoes.  In your handbag, you should have  Snacks (energy bars) Some bottle of water. Bring change for paying cab drivers, so that you are not running around with a $100 bill unable to get change. Some copies of CV (especially for walk-in interviews for industry jobs)  During interview (usually 30-45 minutes)  Usually in a hotel room Talk about your JMP for 15-20 minutes Asked questions related to research and teaching for 5 to 10 minutes You are introduced with the institutions and place Last 2-5 minutes, you will be asked to ask questions.  Do have some good questions (dont ask question that you can an- swer from the website) You might ask research support, quality of students Tell them if your spouse/partner is also looking for academic jobs NEVER talk about salary    Mid-January through March: FLYOUT  If you passed interviews, you will get to visit the place. Scheduling flyout:  Try not to put the most important the first one. You should call the other nearby schools you have interviewed so that costs can be shared. You usually pay for transport and get reimbursed later but hotel is usually covered by the school. Keep all original receipts. Make copies and mail the originals. Never check your baggage! Bring a carry-on with your suits. A typical fly-out:  Arrive the afternoon/night before. Morning:  Someone may pick you up for an informal breakfast. When you arrive, you will be given a schedule with a list of people to meet. Most of time, you talk about your research. Some of the times, you listen their research or even something unrelated.  Lunch:  Usually at the faculty dining hall with a large number of faculty, and not many within your field.  Afternoon:  Job talk: usually 1.5 hrs, make sure that most people understand the first 30 minutes Meet more people The last one to meet is either the department chair or the Dean. – Dinner: Typically with the search committee and department head. A chance to show that you are good person to be colleague. Be relaxed, polite and engage in conversation during these dinners. – Some questions to ask during flyout:  What are the tenure requirements? What has the tenure success rate been in the last few years? Do you find the department to be collegial? Where would you recommend living? Is there any housing subsidy/allowance? Does the department do a good job of supporting new faculty? In terms of research support, mentorship, shielding from service duties, minimizing teaching preps, etc.? Living environments: Are there good schools nearby? Good restau- rants?    February-April: Flyout and Offers  Congratulation! You get an offer after 6-month search process!\n Most of offers are verbal. Written formal offers need to get to the administration so they take a lot of time. Offer always come with deadline. Usual case is two weeks. Ask other schools that you have done a flyout to see if they would also like to make you an offer before the deadline. Try to extend deadline for a few days if necessary but should avoid asking for too many days. Bargaining is usually ONLY possible if you have another offer. Make sure you dont bargain too hard. Make sure you are aware of allowance (education, housing, and medi- cal). Check if you are offered a standard package or not.  JOE: Post-docs and other teaching positions are posted\n  Additional Reading:  Cawley (2012) guide (Must read! Can also read earlier version). Available at AEA William Thomson (2012): Being a graduate student in economics published in A Guide for the Young Economist, MIT Press. Available in working paper version  Supplemetary information: Links to Job Positing  AEA JOE: link Econ Job Market: link ERN Job: link Chronicle of Higher Education (For teaching jobs): link Royal Economic Society (For Europe Jobs): link Academy of Management (For management jobs): link Harvard Abridge List (Useful): link  Supplemetary information: other Job Market Advice  Bluwiki: link Econ Job Rumors: link Cawley Review of Job Market Outcome: link David Levines Cheap Advice: link Harvard Job Market Information: link Stanford Ph.D placement Guide: link Chicago Students Econ Job Market Advice: link Berekely Job Market Packet: link University of Pitt Job Market Information: link Luigi Pistaferri Job Market Advice: link David Laibsons Job Market Note: link Navin Kartiks Job Market Tips: link  ","date":1555776000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1555776000,"objectID":"01c15646c13f99f85c6489c1ab93281b","permalink":"/others/tips/","publishdate":"2019-04-21T00:00:00+08:00","relpermalink":"/others/tips/","section":"others","summary":"This tips is for economic academic job market. This note was prepared based on information adapted from many different sources and experiences of me and others. Now I can no longer tell which part is mine and which part is other. Good luck!\nTimeline Job Market Process usually starts from summer until the April the year after.\n Summer: Get approval from advisor September: Final version of paper October: Register for AEA conference and get ready for application November: Send applications December: Schedule and prepare for interviews January: AEA meeting and flyout February-April: Flyout and offers  Summer: Get approval from advisor  Get one main paper ready (Job market paper; JMP) Polish the paper and send it to your committee.","tags":null,"title":"Job Market Tips","type":"docs"},{"authors":null,"categories":null,"content":" GRANT  \u0026ldquo;I hear I forget, I see I remember, I do I understand - Development of large number templates of visual organizers and graphical illustrations\u0026rdquo;\n Teaching Enhancement Grant (TEG), AY2014/2015, National University of Singapore.   TEACHING ARTICLES  Using formative feedback, peer review, and online video-recorded presentations to enhance students\u0026rsquo; research reports. CDTL Brief, 19(1), 3-9. HTML PDF\n Invited Presentation at FASS Teaching Seminar, NUS, 16 Aug 2016. Slide\n  ","date":1555776000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1555776000,"objectID":"c23b6818ed8af30e17f8364eb95409f5","permalink":"/others/pedagogy/","publishdate":"2019-04-21T00:00:00+08:00","relpermalink":"/others/pedagogy/","section":"others","summary":"GRANT  \u0026ldquo;I hear I forget, I see I remember, I do I understand - Development of large number templates of visual organizers and graphical illustrations\u0026rdquo;\n Teaching Enhancement Grant (TEG), AY2014/2015, National University of Singapore.   TEACHING ARTICLES  Using formative feedback, peer review, and online video-recorded presentations to enhance students\u0026rsquo; research reports. CDTL Brief, 19(1), 3-9. HTML PDF\n Invited Presentation at FASS Teaching Seminar, NUS, 16 Aug 2016.","tags":null,"title":"Pedagogy","type":"docs"},{"authors":null,"categories":null,"content":" I am the main advisor of dissertation for two Ph.D. students, and honor thesis for 17 undergraduate students. Besides, between 2015 and 2018, I have been helping Ph.D. students prepare their academic job market.\nPHD STUDENTS I am the main advisor for two Ph.D. students, and serve in dissertation committees for four Ph.D. students. I also hosted three visiting Ph.D. students.\nMain Advisor  Lu Zhiqi (2019 Expected) Zhang Xuyao (2017, Deputy Director, Asia Competitiveness Institute, Lee Kuen Yew School of Public Policy, National University of Singapore)  Committee Member  Liu Xuyuan (2014, Research Fellow, Risk Management Institute, National University of Singapore) Ding Rong (2015, Assistant Professor, University of International Business and Economics) Liu Bin (2015, Assistant Professor, Chinese University of Hong Kong Shenzhen) Wang Zhe (2017, Post-doc Fellow, Lee Kuen Yew School of Public Policy, National University of Singapore)  Short-term Visting Students  Yujia Cao (Lingnan (University) College, Sun Yat Sen University, 2016-2017) Xu Luyuan (Guangxi University, 2016-2017) Chen Yaqi (Beijing Jiaotong University, 2015-2016)  UNDERGRADUATE I have supervised 17 honor students, 5 independent studies and 2 UROP since 2012.\nHONOR THESIS  Chew Pheeraphol (2018 Spring, Economics)  Quantifying Trading Behavior Of Cryptocurrencies Using Online Search Interest - How Do They React To Speculation And Do They All Behave Similarly?  Mudit Kedia (2018 Spring, Economics)  The Impact Of Prospectus Conservatism On Share Price And Operating Performance: Evidence From Hong Kong.  Shiang Chen Ting (2018 Spring, Economics)  Effect Of News Sentiment On Stock Returns: A Textual Analysis.  Lim Si Min Sally (2018 Spring, Economics and Accounting)  Do Investors Value Tax Avoidance In Singapore-Listed Firms?  Soh Giap Hong Daniel (2017 Fall, Economics)  An Empirical Investigation of the IPO Underpricing Phenomenon: Evidence from the Singapore IPO Market  Chia Keat Loong (2016 Fall, Economics and Finance)  Profitability of Trading Strategies Based on Google Trends  Evelyn Chew Yu Hui (2016 Spring, Economics)  Profiting from the Singapore Stock Market  Lim Cai Jie (2015 Fall, Economics and Finance)  The Term Structure of Stock Return Continuation  Zhao Yin (2015 Fall, Economics, NUS-ANU JDP)  The Dynamics of Global Housing Attainability  Nguyen Hoang Diem An (2015 Spring, Economics)  Are Family Firms Better? Looking from the Firm Profitability and Market Perception Perspective  Chew Yi Peng Lisa (2015 Spring, Economics and Business)  What Value Do Shareholders Place on Firm-held Cash? An Empirical Study of the Singapore Stock Market  Oon Wei Ying (2014 Fall, Economics NUS-ANU JDP)  An Economics Analysis of Multi-Level Marketing  Ngiaw Kee Ann (2014 Fall, Economics)  Explaining Price Anomalies in Simultaneous Ascending Auctions for Coffee  Edmund Chua Zheng Hong (2014 Spring, Economics and Business)  To Race or To Wait? An Analysis of the Trade-offs Between Uncertainty and First Mover Advantage in a Strategic Setting  Anushiya Arunan (2014 Spring, Economics and Environment Engineering)  A Multi-Disciplinary Perspective on Reducing the Carbon Footprint of Wastewater Treatment Plants  Zhe Michelle Dong (2014 Spring, Economics, NUS-ANU JDP)  Too Big to Fail? An Empirical Study on the Default Risk of Leveraged Financial Firms  Jonathan Ne Win (2013 Spring, Economics)  What\u0026rsquo;s in a Dividend? Re–examination of Dividend Theory with U.S. Technology Companies   INDEPENDENT STUDY  Shi Huilin (2018 Spring, Economics)  Analysis On Hong Kong IPO Pricing From A Sentimental Prospective.  Wu Jieli (2016 Spring, Economics)  Predicting Stock Returns in China  Koh Zhi Xing (2015 Spring, USP)  Evidence on Dividend Clienteles: US Technology Stocks   UROP  Lin Jia He (2015 Spring, Economics-Statistics)  Chinese Political System  Lim Hysen (2015 Spring, Economics)  Election System in Hong Kong   ","date":1555776000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1555776000,"objectID":"dcdcb724e48464fdc4079b1d8a468844","permalink":"/others/supervision/","publishdate":"2019-04-21T00:00:00+08:00","relpermalink":"/others/supervision/","section":"others","summary":"I am the main advisor of dissertation for two Ph.D. students, and honor thesis for 17 undergraduate students. Besides, between 2015 and 2018, I have been helping Ph.D. students prepare their academic job market.\nPHD STUDENTS I am the main advisor for two Ph.D. students, and serve in dissertation committees for four Ph.D. students. I also hosted three visiting Ph.D. students.\nMain Advisor  Lu Zhiqi (2019 Expected) Zhang Xuyao (2017, Deputy Director, Asia Competitiveness Institute, Lee Kuen Yew School of Public Policy, National University of Singapore)  Committee Member  Liu Xuyuan (2014, Research Fellow, Risk Management Institute, National University of Singapore) Ding Rong (2015, Assistant Professor, University of International Business and Economics) Liu Bin (2015, Assistant Professor, Chinese University of Hong Kong Shenzhen) Wang Zhe (2017, Post-doc Fellow, Lee Kuen Yew School of Public Policy, National University of Singapore)  Short-term Visting Students  Yujia Cao (Lingnan (University) College, Sun Yat Sen University, 2016-2017) Xu Luyuan (Guangxi University, 2016-2017) Chen Yaqi (Beijing Jiaotong University, 2015-2016)  UNDERGRADUATE I have supervised 17 honor students, 5 independent studies and 2 UROP since 2012.","tags":null,"title":"Supervision","type":"docs"},{"authors":["Chiu Yu Ko"],"categories":[],"content":" from IPython.core.display import Image Image('https://www.python.org/static/community_logos/python-logo-master-v3-TM-flattened.png')  print(\u0026quot;Welcome to Academic!\u0026quot;)  Welcome to Academic!  Install Python and Jupyter Install Anaconda which includes Python 3 and Jupyter notebook.\nOtherwise, for advanced users, install Jupyter notebook with pip3 install jupyter.\nCreate a new blog post as usual Run the following commands in your Terminal, substituting \u0026lt;MY_WEBSITE_FOLDER\u0026gt; and my-post with the file path to your Academic website folder and a name for your blog post (without spaces), respectively:\ncd \u0026lt;MY_WEBSITE_FOLDER\u0026gt; hugo new --kind post post/my-post cd \u0026lt;MY_WEBSITE_FOLDER\u0026gt;/content/post/my-post/  Create or upload a Jupyter notebook Run the following command to start Jupyter within your new blog post folder. Then create a new Jupyter notebook (New \u0026gt; Python Notebook) or upload a notebook.\njupyter notebook  Convert notebook to Markdown jupyter nbconvert Untitled.ipynb --to markdown --NbConvertApp.output_files_dir=. # Copy the contents of Untitled.md and append it to index.md: cat Untitled.md | tee -a index.md # Remove the temporary file: rm Untitled.md  Edit your post metadata Open index.md in your text editor and edit the title etc. in the front matter according to your preference.\nTo set a featured image, place an image named featured into your post\u0026rsquo;s folder.\nFor other tips, such as using math, see the guide on writing content with Academic.\n","date":1549324800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1549324800,"objectID":"6e929dc84ed3ef80467b02e64cd2ed64","permalink":"/post/jupyter/","publishdate":"2019-02-05T00:00:00Z","relpermalink":"/post/jupyter/","section":"post","summary":"Learn how to blog in Academic using Jupyter notebooks","tags":[],"title":"Display Jupyter Notebooks with Academic","type":"post"},{"authors":["Jens Gudmundsson","Jens Hougaard","Chiu Yu Ko"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1546272000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1546272000,"objectID":"9682e0669c182b50b3324a160fcd003b","permalink":"/publication/river-sharing/","publishdate":"2019-01-01T00:00:00+08:00","relpermalink":"/publication/river-sharing/","section":"publication","summary":"We study the decentralized implementation of efficient outcomes through multilateral bargaining in the river sharing problem. We consider a class of mechanisms where agents first announce consumption levels and then bargain over monetary compensation. We first determine which mechanisms give incentives to always allocate the water efficiently. Among these, we take an axiomatic approach to single out three mechanisms that guarantee a fair division of the welfare gain.","tags":["Game Theory","Fair Sharing","Water Sharing"],"title":"Decentralized mechanisms for river sharing","type":"publication"},{"authors":["Fengjiao Chen","Chiu Yu Ko","Duozhe Li"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1546272000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1546272000,"objectID":"a46e7be2cdf6231d416d61294095afb5","permalink":"/publication/outside-option-bargaining/","publishdate":"2019-01-01T00:00:00+08:00","relpermalink":"/publication/outside-option-bargaining/","section":"publication","summary":"A worker with a superior outside offer starts a wage renegotiation with his current employer. The worker may exercise the outside option whenever a proposal is rejected. Entire surplus may be extracted by the worker. Opting out can arise in equilibrium under complete information.","tags":["Game Theory","Bargaining Theory"],"title":"On the Role of Outside Options in Wage Renegotiation","type":"publication"},{"authors":null,"categories":null,"content":"\rI have developed the following R package to determine candle stick patterns. You can check out more at GitHub.\nCandleStickPattern\rThis package finds common candle stick patterns using daily data (OHLC data).\nOverview\rThe current version package covers the following patterns:\n\rDoji family (1-day pattern)\r\rDoji doji()\rDragonfly Doji dragonfly.doji()\rGravestone Doji gravestone.doji()\r\rHammer family (2-day pattern)\r\rHammer/Hangman hammer()\rInverted Hammer/Shooting Star inverted.hammer\r\rEngulfing family (2-day pattern)\r\rBullish Engulfing bullish.engulf()\rBearish Engulfing bearish.engulf()\r\rHarami family (2-day pattern)\r\rBullish Harami bullish.engulf()\rBearish Harami bearish.harami()\r\rReversal family (2-day pattern)\r\rPiercing line piercing.line()\rDark cloud Cover dark.cloud.cover()\r\rKicking family (2-day pattern)\r\rKick up kick.up()\rKick down kick.down()\r\rThree-in-a-row (3-day pattern)\r\rThree white soldiers three.white.soliders()\rThree Black crows three.black.crows()\r\rStar (3-day pattern)\r\rMorning star morning.star()\rEvening star evening.star()\r\rThree Method (5-day pattern)\r\rRising three rising.three()\rFalling three falling.three()\r\r\rMoreover, it captures trends using exponential moving average (EMA):\n\rEMA trends\r\rup trend up.trend()\rdown trend down.trend()\r\r\r\rInstallation\rTo install this package, it is the easist to install devtools package first:\ninstall.packages(\u0026quot;devtools\u0026quot;)\rNow load the package using library()\nlibrary(devtools)\rThen we can use the install_github to get the package directly:\ninstall_github(\u0026quot;kochiuyu/CandleStickPattern\u0026quot;)\rFinally, we load the package using library()\nlibrary(CandleStickPattern)\r\rUsage\rYou can see the details of how each function works in vignette\nThe following demonstrates the usage of the function doji() using Microsoft (ticker: MSFT). We use quantmod package to download data:\nlibrary(quantmod)\rgetSymbols(\u0026quot;MSFT\u0026quot;, from = \u0026quot;2011-07-08\u0026quot; , to = \u0026quot;2011-07-19\u0026quot;)\rWe first plot the candle chart first:\ncandleChart(MSFT,theme=\u0026#39;white\u0026#39;)\rWe can see that July 11, 12, 13, and 18 are likely to follow doji pattern. Let us see if we can capture using the function doji:\ndoji(MSFT)\r## doji\r## 2011-07-08 FALSE\r## 2011-07-11 TRUE\r## 2011-07-12 TRUE\r## 2011-07-13 TRUE\r## 2011-07-14 FALSE\r## 2011-07-15 FALSE\r## 2011-07-18 TRUE\r## 2011-07-19 FALSE\r\r\r","date":1536422400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1536422400,"objectID":"69fe37705d4e5f75bb3555b86d607a16","permalink":"/r/package/","publishdate":"2018-09-09T00:00:00+08:00","relpermalink":"/r/package/","section":"r","summary":"I have developed the following R package to determine candle stick patterns. You can check out more at GitHub.\nCandleStickPattern\rThis package finds common candle stick patterns using daily data (OHLC data).\nOverview\rThe current version package covers the following patterns:\n\rDoji family (1-day pattern)\r\rDoji doji()\rDragonfly Doji dragonfly.doji()\rGravestone Doji gravestone.doji()\r\rHammer family (2-day pattern)\r\rHammer/Hangman hammer()\rInverted Hammer/Shooting Star inverted.hammer\r\rEngulfing family (2-day pattern)\r\rBullish Engulfing bullish.","tags":null,"title":"Candle Stick","type":"docs"},{"authors":null,"categories":null,"content":"","date":1536422400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1536422400,"objectID":"fb6fdef89b0f7f16fd3672e5e69078f4","permalink":"/r/testing/","publishdate":"2018-09-09T00:00:00+08:00","relpermalink":"/r/testing/","section":"r","summary":"","tags":null,"title":"Candle Stick","type":"docs"},{"authors":["Rube Juarez","Chiu Yu Ko","Jingyi Xue"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1535731200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1535731200,"objectID":"e14936b0ba5ff3fc238e361eba68cd1a","permalink":"/publication/network-sharing/","publishdate":"2018-09-01T00:00:00+08:00","relpermalink":"/publication/network-sharing/","section":"publication","summary":"We study the decentralized implementation of efficient outcomes through multilateral bargaining in the river sharing problem. We consider a class of mechanisms where agents first announce consumption levels and then bargain over monetary compensation. We first determine which mechanisms give incentives to always allocate the water efficiently. Among these, we take an axiomatic approach to single out three mechanisms that guarantee a fair division of the welfare gain.","tags":["Game Theory","Fair Sharing","Network Sharing"],"title":"Sharing sequential values in a network","type":"publication"},{"authors":null,"categories":null,"content":"I am the coordinator the Second Singapore Economics PhD Conference (2nd SEPC) will be held at the National University of Singapore on 18th November, 2016 (Friday). The first conference (1st SEPC) was organized by the Division of Economics at Nanyang Technological University on 22nd April, 2016. This conference series aims to feature the collective works of Economics PhD students based in Singapore.\nFor details, please visit https://sites.google.com/site/sgeconphdcon/\n","date":1524240000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1524240000,"objectID":"6241636e178760ebc81a620eda7707e5","permalink":"/others/phdconference/","publishdate":"2018-04-21T00:00:00+08:00","relpermalink":"/others/phdconference/","section":"others","summary":"I am the coordinator the Second Singapore Economics PhD Conference (2nd SEPC) will be held at the National University of Singapore on 18th November, 2016 (Friday). The first conference (1st SEPC) was organized by the Division of Economics at Nanyang Technological University on 22nd April, 2016. This conference series aims to feature the collective works of Economics PhD students based in Singapore.\nFor details, please visit https://sites.google.com/site/sgeconphdcon/","tags":null,"title":"PhD Conference","type":"docs"},{"authors":null,"categories":null,"content":"I am currently the coordinator for the reading group. Please email me if you want to be included into the mailing list or present in our workshop.\n Time: Monday 12:00nn-1:00pm Venue: AS2-05-10, National University of Singapore, 1 Arts Link, Singapore 117570  ","date":1524240000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1524240000,"objectID":"f6c1458bfc127febb807ee588a2102cd","permalink":"/others/readinggroup/","publishdate":"2018-04-21T00:00:00+08:00","relpermalink":"/others/readinggroup/","section":"others","summary":"I am currently the coordinator for the reading group. Please email me if you want to be included into the mailing list or present in our workshop.\n Time: Monday 12:00nn-1:00pm Venue: AS2-05-10, National University of Singapore, 1 Arts Link, Singapore 117570  ","tags":null,"title":"Reading Group","type":"docs"},{"authors":["Chiu Yu Ko"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1502899200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1502899200,"objectID":"173b3c486a2760cb9844ba9a431a3cae","permalink":"/publication/common-agency/","publishdate":"2017-08-17T00:00:00+08:00","relpermalink":"/publication/common-agency/","section":"publication","summary":"In common agency games without budget constraints and outside option, Bernheim and Whinston (1986) show that CPNE=TNE=Principal-optimal core in the payoff space. With budget constraints or outside options, CPNE and TNE may not exist and may not be equivalent to each other. TNEs can be Pareto ranked, contrary to Dixit, Grossman, and Helpman (1996). CPNEs do not avoid a coordination problem, as they can be Pareto dominated by a TNE.","tags":["Game Theory","Political Economy"],"title":"A Note on Budget Constraints and Outside Options in Common Agency","type":"publication"},{"authors":null,"categories":null,"content":"Overview\n We cover how theoretical models and the associated empirical analysis can be applied in practice We first review classical stock market analysis techniques: fundamental analysis and technical analysis. We investigate various trading strategies adopted by market participants. We continue to study how modern time series models can help to analyze and predict future stock price. Then we examine several market microstructure models. trading models. to understand trading behavior such as bid-ask spread, liquidity, trading volume, and trading behaviors, Finanly, to understand increasingly popular computerized trading, we cover programming and econometric software such as Excel VBA and R.   Topics:\n Equity research Technical trading Investor trading behavior Excel VBA programming R programming   ","date":1461686400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461686400,"objectID":"5ce0cee691a7b08305c2436b5861c77e","permalink":"/teaching/applied-financial-economics/","publishdate":"2016-04-27T00:00:00+08:00","relpermalink":"/teaching/applied-financial-economics/","section":"teaching","summary":"Master (Spring 2017, Spring 2018, Spring 2019)","tags":["Master"],"title":"Applied Financial Economics","type":"teaching"},{"authors":null,"categories":null,"content":"","date":1461686400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461686400,"objectID":"d1311ddf745551c9e117aa4bb7e28516","permalink":"/project/external-project/","publishdate":"2016-04-27T00:00:00+08:00","relpermalink":"/project/external-project/","section":"project","summary":"An example of linking directly to an external project website using `external_link`.","tags":["Demo"],"title":"External Project","type":"project"},{"authors":null,"categories":null,"content":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Duis posuere tellus ac convallis placerat. Proin tincidunt magna sed ex sollicitudin condimentum. Sed ac faucibus dolor, scelerisque sollicitudin nisi. Cras purus urna, suscipit quis sapien eu, pulvinar tempor diam. Quisque risus orci, mollis id ante sit amet, gravida egestas nisl. Sed ac tempus magna. Proin in dui enim. Donec condimentum, sem id dapibus fringilla, tellus enim condimentum arcu, nec volutpat est felis vel metus. Vestibulum sit amet erat at nulla eleifend gravida.\nNullam vel molestie justo. Curabitur vitae efficitur leo. In hac habitasse platea dictumst. Sed pulvinar mauris dui, eget varius purus congue ac. Nulla euismod, lorem vel elementum dapibus, nunc justo porta mi, sed tempus est est vel tellus. Nam et enim eleifend, laoreet sem sit amet, elementum sem. Morbi ut leo congue, maximus velit ut, finibus arcu. In et libero cursus, rutrum risus non, molestie leo. Nullam congue quam et volutpat malesuada. Sed risus tortor, pulvinar et dictum nec, sodales non mi. Phasellus lacinia commodo laoreet. Nam mollis, erat in feugiat consectetur, purus eros egestas tellus, in auctor urna odio at nibh. Mauris imperdiet nisi ac magna convallis, at rhoncus ligula cursus.\nCras aliquam rhoncus ipsum, in hendrerit nunc mattis vitae. Duis vitae efficitur metus, ac tempus leo. Cras nec fringilla lacus. Quisque sit amet risus at ipsum pharetra commodo. Sed aliquam mauris at consequat eleifend. Praesent porta, augue sed viverra bibendum, neque ante euismod ante, in vehicula justo lorem ac eros. Suspendisse augue libero, venenatis eget tincidunt ut, malesuada at lorem. Donec vitae bibendum arcu. Aenean maximus nulla non pretium iaculis. Quisque imperdiet, nulla in pulvinar aliquet, velit quam ultrices quam, sit amet fringilla leo sem vel nunc. Mauris in lacinia lacus.\nSuspendisse a tincidunt lacus. Curabitur at urna sagittis, dictum ante sit amet, euismod magna. Sed rutrum massa id tortor commodo, vitae elementum turpis tempus. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean purus turpis, venenatis a ullamcorper nec, tincidunt et massa. Integer posuere quam rutrum arcu vehicula imperdiet. Mauris ullamcorper quam vitae purus congue, quis euismod magna eleifend. Vestibulum semper vel augue eget tincidunt. Fusce eget justo sodales, dapibus odio eu, ultrices lorem. Duis condimentum lorem id eros commodo, in facilisis mauris scelerisque. Morbi sed auctor leo. Nullam volutpat a lacus quis pharetra. Nulla congue rutrum magna a ornare.\nAliquam in turpis accumsan, malesuada nibh ut, hendrerit justo. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Quisque sed erat nec justo posuere suscipit. Donec ut efficitur arcu, in malesuada neque. Nunc dignissim nisl massa, id vulputate nunc pretium nec. Quisque eget urna in risus suscipit ultricies. Pellentesque odio odio, tincidunt in eleifend sed, posuere a diam. Nam gravida nisl convallis semper elementum. Morbi vitae felis faucibus, vulputate orci placerat, aliquet nisi. Aliquam erat volutpat. Maecenas sagittis pulvinar purus, sed porta quam laoreet at.\n","date":1461686400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461686400,"objectID":"5f19cd7ba7bacbf9afc1b7ee46806187","permalink":"/project/fair-sharing/","publishdate":"2016-04-27T00:00:00+08:00","relpermalink":"/project/fair-sharing/","section":"project","summary":"An example of using the in-built project page.","tags":["Game Theory","Fair Sharing"],"title":"Fair Sharing","type":"project"},{"authors":null,"categories":null,"content":"Overview:\n Market microstructure studies price movement and how trading takes place in financial markets. First, We analyze the movement of security prices by fundamental analysis, technical analysis, time series, trade price and factor price models. Second, we investigate models of trading: inventory models, sequential trading models, strategic trading and behavioral models.  Topics:\n Fundamental analysis Technical analysis Time series analysis Event study methdology Factor pricing models Inventory models Sequential trade models Strategic tarde models Behavorial models  ","date":1461686400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461686400,"objectID":"19401eb6896b397946be3389103456a8","permalink":"/teaching/financial-market-microstructure/","publishdate":"2016-04-27T00:00:00+08:00","relpermalink":"/teaching/financial-market-microstructure/","section":"teaching","summary":"Undergraduate (Fall 2015, Fall 2016, Fall 2017, Spring 2018, Fall 2018, Spring 2019)","tags":["Undergraduate"],"title":"Financial Market Microsturcture","type":"teaching"},{"authors":null,"categories":null,"content":"Overview:\n Review Basic concepts of the non-cooperative game theory Build foundation to study various applications of game-theoretic models in the field of industrial organization. in-depth analysis and understand various theoretical issues of the modern industrial organization. the approach of this course is game theoretic   Topics:\n Monopoly pricing Monopoly dynamic decision Competition with homogeneous good Competitio with produce differentiation Network externality Consmer Search Innovation and technology Entry deterence Collusion  ","date":1461686400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461686400,"objectID":"f1e6d6ec52b26d842638de2a12820b94","permalink":"/teaching/industrial-organization/","publishdate":"2016-04-27T00:00:00+08:00","relpermalink":"/teaching/industrial-organization/","section":"teaching","summary":"Ph.D. (Fall 2012, Fall 2013, Fall 2014, Fall 2015, Fall 2016)","tags":["PhD"],"title":"Industrial Organization","type":"teaching"},{"authors":["Chiu Yu Ko"],"categories":null,"content":" Create a free website with Academic using Markdown, Jupyter, or RStudio. Choose a beautiful color theme and build anything with the Page Builder - over 40 widgets, themes, and language packs included!\nCheck out the latest demo of what you\u0026rsquo;ll get in less than 10 minutes, or view the showcase of personal, project, and business sites.\n Setup Academic Get Started View the documentation Ask a question Request a feature or report a bug Updating? View the Update Guide and Release Notes Support development of Academic:  Donate a coffee Become a backer on Patreon Decorate your laptop or journal with an Academic sticker Wear the T-shirt   \nKey features:\n Page builder - Create anything with widgets and elements Edit any type of content - Blog posts, publications, talks, slides, projects, and more! Create content in Markdown, Jupyter, or RStudio Plugin System - Fully customizable color and font themes Display Code and Math - Code highlighting and LaTeX math supported Integrations - Google Analytics, Disqus commenting, Maps, Contact Forms, and more! Beautiful Site - Simple and refreshing one page design Industry-Leading SEO - Help get your website found on search engines and social media Media Galleries - Display your images and videos with captions in a customizable gallery Mobile Friendly - Look amazing on every screen with a mobile friendly version of your site Multi-language - 15+ language packs including English, 中文, and Português Multi-user - Each author gets their own profile page Privacy Pack - Assists with GDPR Stand Out - Bring your site to life with animation, parallax backgrounds, and scroll effects One-Click Deployment - No servers. No databases. Only files.  Color Themes Academic comes with day (light) and night (dark) mode built-in. Click the sun/moon icon in the top right of the Demo to see it in action!\nChoose a stunning color and font theme for your site. Themes are fully customizable and include:\n         Ecosystem  Academic Admin: An admin tool to import publications from BibTeX or import assets for an offline site Academic Scripts: Scripts to help migrate content to new versions of Academic  Install You can choose from one of the following four methods to install:\n one-click install using your web browser (recommended) install on your computer using Git with the Command Prompt/Terminal app install on your computer by downloading the ZIP files install on your computer with RStudio  Then personalize and deploy your new site.\nUpdating View the Update Guide.\nFeel free to star the project on Github to help keep track of updates.\nLicense Copyright 2016-present George Cushen.\nReleased under the MIT license.\n","date":1461081600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1555430400,"objectID":"279b9966ca9cf3121ce924dca452bb1c","permalink":"/post/getting-started/","publishdate":"2016-04-20T00:00:00+08:00","relpermalink":"/post/getting-started/","section":"post","summary":"Create a beautifully simple website in under 10 minutes.","tags":["Academic"],"title":"Academic: the website builder for Hugo","type":"post"},{"authors":["Chiu Yu Ko","Mak Koyama","Tuan-Hwee Sng"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1441036800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1441036800,"objectID":"443936370cd03356f4864fbea4502c52","permalink":"/publication/europe-china/","publishdate":"2015-09-01T00:00:00+08:00","relpermalink":"/publication/europe-china/","section":"publication","summary":"Severe and unidirectional threat of external invasion fostered political centralization in China. Europe faced a wider variety of smaller external threats and remained politically fragmented. Political centralization in China led to lower taxation and hence faster population growth during peacetime than in Europe. China was relatively fragile in the event of an external invasion.","tags":["Game Theory","Political Economy","Political History"],"title":"Unified China and Divided Europe","type":"publication"},{"authors":null,"categories":["R"],"content":"\rR Markdown\rThis is an R Markdown document. Markdown is a simple formatting syntax for authoring HTML, PDF, and MS Word documents. For more details on using R Markdown see http://rmarkdown.rstudio.com.\nYou can embed an R code chunk like this:\nsummary(cars)\r## speed dist ## Min. : 4.0 Min. : 2.00 ## 1st Qu.:12.0 1st Qu.: 26.00 ## Median :15.0 Median : 36.00 ## Mean :15.4 Mean : 42.98 ## 3rd Qu.:19.0 3rd Qu.: 56.00 ## Max. :25.0 Max. :120.00\rfit \u0026lt;- lm(dist ~ speed, data = cars)\rfit\r## ## Call:\r## lm(formula = dist ~ speed, data = cars)\r## ## Coefficients:\r## (Intercept) speed ## -17.579 3.932\r\rIncluding Plots\rYou can also embed plots. See Figure 1 for example:\npar(mar = c(0, 1, 0, 1))\rpie(\rc(280, 60, 20),\rc(\u0026#39;Sky\u0026#39;, \u0026#39;Sunny side of pyramid\u0026#39;, \u0026#39;Shady side of pyramid\u0026#39;),\rcol = c(\u0026#39;#0292D8\u0026#39;, \u0026#39;#F7EA39\u0026#39;, \u0026#39;#C4B632\u0026#39;),\rinit.angle = -50, border = NA\r)\r\rFigure 1: A fancy pie chart.\r\r\r","date":1437703994,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1437703994,"objectID":"10065deaa3098b0da91b78b48d0efc71","permalink":"/post/2015-07-23-r-rmarkdown/","publishdate":"2015-07-23T21:13:14-05:00","relpermalink":"/post/2015-07-23-r-rmarkdown/","section":"post","summary":"R Markdown\rThis is an R Markdown document. Markdown is a simple formatting syntax for authoring HTML, PDF, and MS Word documents. For more details on using R Markdown see http://rmarkdown.rstudio.com.\nYou can embed an R code chunk like this:\nsummary(cars)\r## speed dist ## Min. : 4.0 Min. : 2.00 ## 1st Qu.:12.0 1st Qu.: 26.00 ## Median :15.0 Median : 36.00 ## Mean :15.4 Mean : 42.98 ## 3rd Qu.","tags":["R Markdown","plot","regression"],"title":"Hello R Markdown","type":"post"},{"authors":["Chiu Yu Ko","Tuan-Hwee Sng"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1376668800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1376668800,"objectID":"654f2fb68852484a51175434bd288c61","permalink":"/publication/dependence-china/","publishdate":"2013-08-17T00:00:00+08:00","relpermalink":"/publication/dependence-china/","section":"publication","summary":"Eurasian geography created significant and persistent defense externalities between the Chinese regions. Centralized state is required to enforce cooperation. Building of the national capital in the region where the externality originate. Explain why China’s capitals in strategically important north and west instead of the economically productive south and east.","tags":["Economic History","Political Economy"],"title":"Regional Dependence and Political Centralization in Imperial China","type":"publication"},{"authors":["Anthony Creane","Chiu Yu Ko","Hideo Konishi"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1373644800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1373644800,"objectID":"1787bcdb00a46101b111a6ca4b3a511d","permalink":"/publication/choosing-rivals/","publishdate":"2013-07-13T00:00:00+08:00","relpermalink":"/publication/choosing-rivals/","section":"publication","summary":"Licensing technology to a rival firm when firms have heterogeneous technologies. If a third firm remains in the industry, licensing technology is profitable. Dependent on criteria, chosen licensees are different. Joint-profit- or welfare-maximization, or auction outcomes as a selection criterion.","tags":["Game Theory","Industrial Organization","Innovation"],"title":"Choosing a licensee from heterogeneous rivals","type":"publication"},{"authors":null,"categories":null,"content":"Overview\n Begin with a normative perspective and ask how consumers derive their choices from preferences and what allocations are efficient Then turn to a positive study focusing on competitive markets and strategic interactions. the development of analytical tools and the understanding of how the theories are constructed and the working and failure cases of the market system.   Topics:\n Consumer theory Production theory General equilibrium Uncertainty Game theory Information economics Auction Matching  ","date":1335456000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1335456000,"objectID":"6717ed01b17db37fe760645af8316c45","permalink":"/teaching/microeconomics/","publishdate":"2012-04-27T00:00:00+08:00","relpermalink":"/teaching/microeconomics/","section":"teaching","summary":"Undergraduate (Fall 2012, Fall 2013, Spring 2015)","tags":["Undergraduate"],"title":"Microeconomics Analysis III","type":"teaching"},{"authors":["Anthony Creane","Chiu Yu Ko","Hideo Konishi"],"categories":null,"content":" Supplementary notes can be added here, including code and math.   ","date":1313510400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1313510400,"objectID":"9103b6fdfbd48745a63de42bb46ab317","permalink":"/publication/matchmaker/","publishdate":"2011-08-17T00:00:00+08:00","relpermalink":"/publication/matchmaker/","section":"publication","summary":"Profit-maximizing matchmaker in the many-to-one assignment problem. Consider individualized and package price message spaces as firmsʼ strategy sets. Restricting message space improves resource allocation.  Implementation of the stable correspondence in strong equilibrium.","tags":["Game Theory","Matching Market"],"title":"Profit-maximizing Matchmaker","type":"publication"},{"authors":null,"categories":null,"content":" Departmental Committee works for the Department of Economics, National University of Singapore:\n Coordinator, Applied Theory and Industrial Organization Workshop, 2013-Present. Co-organizer, Multi-sided Platform Workshop, 2013. Applied Economics Program,2014-2015, 2017-2018. Graduate Program Committee, 2013-2014, 2015-Present. Subcommittee on collaborative programs (double degree programs), 2018-Present.  Professional Ad-hoc referees for:\n Australian Economic Papers Economic Bulletin Economic Record Games and Economic Behavior International Economic Review International Journal of Game Theory Journal of Economic and Behavior Organization Journal of Mathematical Economics Journal of Public Economic Theory Mathematical Social Science Review of Network Economics  ","date":1271779200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1271865600,"objectID":"14cf6e539aa1135cfa09525c06acb701","permalink":"/others/service/","publishdate":"2010-04-21T00:00:00+08:00","relpermalink":"/others/service/","section":"others","summary":" Departmental Committee works for the Department of Economics, National University of Singapore:\n Coordinator, Applied Theory and Industrial Organization Workshop, 2013-Present. Co-organizer, Multi-sided Platform Workshop, 2013. Applied Economics Program,2014-2015, 2017-2018. Graduate Program Committee, 2013-2014, 2015-Present. Subcommittee on collaborative programs (double degree programs), 2018-Present.  Professional Ad-hoc referees for:\n Australian Economic Papers Economic Bulletin Economic Record Games and Economic Behavior International Economic Review International Journal of Game Theory Journal of Economic and Behavior Organization Journal of Mathematical Economics Journal of Public Economic Theory Mathematical Social Science Review of Network Economics  ","tags":null,"title":"Service","type":"docs"},{"authors":null,"categories":null,"content":" Welcome to Slides Academic\nFeatures  Efficiently write slides in Markdown 3-in-1: Create, Present, and Publish your slides Supports speaker notes Mobile friendly slides  Controls  Next: Right Arrow or Space Previous: Left Arrow Start: Home Finish: End Overview: Esc Speaker notes: S Fullscreen: F Zoom: Alt + Click PDF Export: E  Code Highlighting Inline code: variable\nCode block:\nporridge = \u0026quot;blueberry\u0026quot; if porridge == \u0026quot;blueberry\u0026quot;: print(\u0026quot;Eating...\u0026quot;)  Math In-line math: $x + y = z$\nBlock math:\n$$ f\\left( x \\right) = \\;\\frac{{2\\left( {x + 4} \\right)\\left( {x - 4} \\right)}}{{\\left( {x + 4} \\right)\\left( {x + 1} \\right)}} $$\nFragments Make content appear incrementally\n{{% fragment %}} One {{% /fragment %}} {{% fragment %}} **Two** {{% /fragment %}} {{% fragment %}} Three {{% /fragment %}}  Press Space to play!\nOne  Two  Three \nA fragment can accept two optional parameters:\n class: use a custom style (requires definition in custom CSS) weight: sets the order in which a fragment appears  Speaker Notes Add speaker notes to your presentation\n{{% speaker_note %}} - Only the speaker can read these notes - Press `S` key to view {{% /speaker_note %}}  Press the S key to view the speaker notes!\n Only the speaker can read these notes Press S key to view   Themes  black: Black background, white text, blue links (default) white: White background, black text, blue links league: Gray background, white text, blue links beige: Beige background, dark text, brown links sky: Blue background, thin dark text, blue links   night: Black background, thick white text, orange links serif: Cappuccino background, gray text, brown links simple: White background, black text, blue links solarized: Cream-colored background, dark green text, blue links  Custom Slide Customize the slide style and background\n{{\u0026lt; slide background-image=\u0026quot;/img/boards.jpg\u0026quot; \u0026gt;}} {{\u0026lt; slide background-color=\u0026quot;#0000FF\u0026quot; \u0026gt;}} {{\u0026lt; slide class=\u0026quot;my-style\u0026quot; \u0026gt;}}  Custom CSS Example Let\u0026rsquo;s make headers navy colored.\nCreate assets/css/reveal_custom.css with:\n.reveal section h1, .reveal section h2, .reveal section h3 { color: navy; }  Questions? Ask\nDocumentation\n","date":-62135596800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"0e6de1a61aa83269ff13324f3167c1a9","permalink":"/slides/example/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/slides/example/","section":"slides","summary":"Welcome to Slides Academic\nFeatures  Efficiently write slides in Markdown 3-in-1: Create, Present, and Publish your slides Supports speaker notes Mobile friendly slides  Controls  Next: Right Arrow or Space Previous: Left Arrow Start: Home Finish: End Overview: Esc Speaker notes: S Fullscreen: F Zoom: Alt + Click PDF Export: E  Code Highlighting Inline code: variable\nCode block:\nporridge = \u0026quot;blueberry\u0026quot; if porridge == \u0026quot;blueberry\u0026quot;: print(\u0026quot;Eating...\u0026quot;)  Math In-line math: $x + y = z$","tags":null,"title":"Slides","type":"slides"}]